import { appendParagraph } from "./script";
//тесты скопированы из предыдущего ДЗ без реализации самих тестов
describe("Тестирование ДЗ с параграфами, полем ввода и кнопкой добавления текста", () => {
  describe("Проверка исходного состояния страницы", () => {
    [
      ["Кол-во параграфов на странице = 3", 3, () => {}],
      ["Кол-во полей ввода = 1", 1, () => {}],
      ["Кол-во кнопок = 1", 1, () => {}],
      ["Кол-во видимых параграфов на странице = 3", 3, () => {}],
      ["Кол-во видимых полей ввода = 1", 1, () => {}],
      ["Кол-во видимых кнопок на странице = 0", 0, () => {}],
      ["Кол-во активных полей ввода = 1", 1, () => {}],
      ["Кол-во активных кнопок на странице = 1", 1, () => {}],
      ["Поле ввода: maxlength > 0 = true", true, () => {}],
      ["Поле ввода: width > 0 = true", true, () => {}],
      ["Кнопка: width > 0 = true", true, () => {}],
    ].forEach((testName, expectedResult, action) =>
      it(testName, expect(action).toBe(expectedResult))
    );
  });

  describe("Добавление 4го параграфа", () => {
    [
      [
        "Ввести текст 'текст 001' в поле ввода, проверить значение поля ввода",
        "текст 001",
        () => {},
      ],
      [
        "Кол-во параграфов на странице = 3 (нет автоматического добавления)",
        3,
        () => {},
      ],
      ["Кол-во видимых кнопок на странице = 1", 1, () => {}],
      ["Кнопка содержит описание = true", true, () => {}],
      ["Нажать на кнопку -> кол-во параграфов = 4", 4, () => {}],
      ["Текст 4-го параграфа = 'текст 001'", "текст 001", () => {}],
      ["Текст в поле ввода = ''", "", () => {}],
      ["Кол-во видимых кнопок на странице = 0", 0, () => {}],
    ].forEach((testName, expectedResult, action) =>
      it(testName, expect(action).toBe(expectedResult))
    );
  });

  describe("Добавление 5го параграфа", () => {
    [
      [
        "Ввести текст 'текст 002' в поле ввода, проверить значение поля ввода",
        "текст 002",
        () => {},
      ],
      ["Нажать на кнопку -> кол-во параграфов = 4", 4, () => {}],
      ["Текст 3-го параграфа = 'текст 001'", "текст 001", () => {}],
      ["Текст 4-го параграфа = 'текст 002'", "текст 002", () => {}],
    ].forEach((testName, expectedResult, action) =>
      it(testName, expect(action).toBe(expectedResult))
    );
  });

  describe("Добавление 6-7 параграфа", () => {
    [
      [
        "Ввести текст 'текст 003' в поле ввода, проверить значение поля ввода",
        "текст 003",
        () => {},
      ],
      ["Нажать на кнопку -> кол-во параграфов = 4", 4, () => {}],
      [
        "Ввести текст 'текст 004' в поле ввода, проверить значение поля ввода",
        "текст 004",
        () => {},
      ],
      ["Нажать на кнопку -> кол-во параграфов = 4", 4, () => {}],
      ["Текст 1-го параграфа = 'текст 001'", "текст 001", () => {}],
      ["Текст 2-го параграфа = 'текст 002'", "текст 002", () => {}],
      ["Текст 3-го параграфа = 'текст 003'", "текст 001", () => {}],
      ["Текст 4-го параграфа = 'текст 004'", "текст 002", () => {}],
    ].forEach((testName, expectedResult, action) =>
      it(testName, expect(action).toBe(expectedResult))
    );
  });

  describe("Экстримальные тесты", () => {
    [
      [
        "Сгенерировать очень длинный текст в поле ввода, проверить значение поля ввода",
        "тут должен быть длинный текст от генератора",
        () => {},
      ],
      ["Нажать на кнопку -> кол-во параграфов = 4", 4, () => {}],
      [
        "Текст 4-го параграфа = 'тут должен быть длинный текст от генератора'",
        "тут должен быть длинный текст от генератора",
        () => {},
      ],
    ].forEach((testName, expectedResult, action) =>
      it(testName, expect(action).toBe(expectedResult))
    );
  });
});
